#1. Створіть словник, зв'язавши його з змінною school, і наповніть його даними, які б відображали кількість учнів
# в десяти різних класах (наприклад, 1а, 1б, 2б, 6а, 7в тощо.). Дізнайтеся скільки людей в певному класі.
#Уявіть, що в школі відбулися зміни, додайте їх в словник:
#- В трьох класах змінилося кількість учнів;
#- В школі з'явилося два нових класу;
#- В школі розформували один з класів.
#Виведіть вміст словника на екран.

school = {"1a": 23, "1b": 27, "2a": 25, "2b": 27, "3a": 32,
          "5a": 21, "5b": 17, "6a": 19, "6b": 18, "7": 29}

#students in 6b
print(school["6b"])
#+2
school["8"] = 27
school["9"] = 26
#-1
school.pop("5b")

print(school)

print("School:")
for key, value in school.items():
    print('Class "%s" : %d students' %(key, value))
